Repository: evanet08/eSchoolMobile
Catalog: lib/l10n/app_*.arb
Languages: sw

# authentication_msg
source: For school staff, students and parents of students
sw: Kwa wafanyikazi wa shule, wanafunzi na wazazi wa wanafunzi

source: Authentication
sw: Uthibitishaji

source: Username
sw: Jina la mtumiaji

source: Password
sw: Nenosiri

source: Your password
sw: Nenosiri yako

# create_account
source: Create my account
sw: Fungua akaunti

source: Forgot password
sw: Nimesahau nenosiri

source: Login
sw: Ingia

source: Remember me
sw: Nikumbuke

# send_otp_msg
source: A validation code will be send to this phone number for the next step
sw: Nambari ya kuthibitisha itatumwa kwa nambari hii ya simu kwa hatua inayofuata

source: Phone number
sw: Number ya simu ya mkononi

source: Your phone number
sw: Number ya simu yako ya mkononi

# send_otp
source: Send the code
sw: Tuma nambari ya kuthibitisha

# enter_phone_number_for_makin_account
source: Enter below your phone number for your account
sw: Andika hapa chini nambari yako ya simu kwa akaunti yako

# enter_phone_number_for_account_verification
source: Enter below your phone number to verify your account
sw: Andika hapa chini nambari yako ya simu ili kuthibitisha akaunti yako

source: Code verification
sw: Uthibitishaji wa msimbo

# sending_otp_msg
source: We have sent the code verification to
sw: Tumetuma uthibitishaji wa msimbo kwa

# ask_change_phone_number
source: Change phone number?
sw: Ungependa kubadilisha nambari ya simu?

source: Resend code after
sw: Tuma tena msimbo baada ya

# ask_code_not_received
source: Code not received?
sw: Msimbo haujapokelewa?

source: Resend
sw: Tuma tena

source: English
sw: Kingereza

source: French
sw: Kifaransa

source: Swahili
sw: Kiswahili

source: User identity
sw: Utambulisho wa mtumiaji

source: Name
sw: Jina

source: Your name
sw: Jina yako

source: Last name
sw: Jina ya kwanza

source: Your last name
sw: Jina yako ya kwanza

# place_birth
source: Place of birth
sw: Mahali pakuzaliwa

# your_place_birth
source: Your place of birth
sw: Mahali yako ya kuzaliwa

source: Date of birth
sw: Tariki ya kuzaliwa

# send
source: Submit
sw: Tuma

source: Day
sw: Siku

source: Month
sw: Mwezi

source: Year
sw: Mwaka

source: Address
sw: Anwani

source: Country
sw: Nchi

source: City
sw: Jiji

source: State
sw: Jimbo

# id
source: Identity card/Passport
sw: Kitambulisho/Pasipoti

source: Capture
sw: Nasa

source: Browse
sw: Vinjari

source: Profile picture
sw: Picha ya wasifu

source: New password
sw: Nenosiri mpya

source: Your new password
sw: Nenosiri mpya lako

# conf_password
source: Password confirmation
sw: Uthibitishaji wa nenosiri

# conf_new_password
source: Your new password confirmation
sw: Uthibitishaji wa nenosiri lako jipya

source: Success
sw: Mafanikio

source: Account username
sw: Jina la mtumiaji ya akaunti

source: Account password
sw: Nenosiri ya akaunti

source: Menus
sw: Menyu

source: Powered by
sw: Inaendeshwa na

# reset_password_success_msg
source: Your password has been changed successfully
sw: Nenosiri lako limebadilishwa kwa mafanikio

source: Picture
sw: Picha

# wait
source: Please wait...
sw: Tafadhali subiri...

source: My Profile
sw: Wasifu Wangu

source: Log out
sw: Toka nje

# empty_email_alert
source: Please enter your e-mail address
sw: Tafadhali weka anwani yako ya barua pepe

# invalid_email_alert
source: Please enter a valid e-mail address
sw: Tafadhali weka anwani halali ya barua pepe

# empty_password_alert
source: Please enter your password
sw: Tafadhali weka nenosiri lako

# success_login
source: Login success
sw: Mafanikio ya kuingia

# failed_login
source: Login Error. Please verify your credentials
sw: Hitilafu ya Kuingia

source: Language
sw: Luga

# empty_conf_password_alert
source: Please confirm your password
sw: Tafadhali thibitisha nenosiri lako

# all_classes
source: My all classes
sw: Darasa zote

source: Save
sw: Hifadhi

# logging_out_success
source: Logged Out Successfully
sw: Umetoka nje kwa Mafanikio

source: Error Logging Out
sw: Hitilafu katika Kuondoka

source: Excellent
sw: Bora kabisa

source: Optional
sw: Hiari

source: Comment
sw: Maoni

source: Your comment
sw: Maoni yako

source: Research
sw: Tafuta

source: Phone
sw: Simu

# no_have_account
source: Don't you have an account? :
sw: Una akunti? :

source: E-mail
sw: barua pepe

# your_email
source: Your e-mail address
sw: Anwani yako ya barua pepe

# all_courses
source: My all courses
sw: Kozi zote

# enregistrement_note_title
source: Recording of students's notes in {classe} class on {cours} course
sw: Kurekodi pointi za wanafunzi katika darasa la {classe} kwenye kozi ya {cours}

source: Schedules
sw: Ratiba

source: Schedule
sw: Ratiba

source: Grades
sw: Ma noti

source: Students
sw: Wanafunzi

source: Student
sw: Mwanafunzi

source: Teacher
sw: Mwalimu

source: Parent
sw: Mzazi

source: Your status
sw: Hadhi yako

source: Behaviors
sw: Mwenendo

source: Behavior
sw: Mwenendo

source: Apply
sw: Ingiza

# behavior_of
source: Behavior of {eleve}
sw: Mwenendo wa {eleve}

source: Ratings
sw: Ukadiriaji

source: Rating
sw: Ukadiriaji

source: Father
sw: Baba

source: Mother
sw: Mama

# parents_contancts
source: Parents contacts
sw: Contacts parents

source: Student infos
sw: Informations de l'élève

source: All students
sw: Wanafunzi wote

# empty_user_status_alert
source: Please specify your user status
sw: Tafadhali eleza hadhi yako ya mtumiaji

source: Logging out...
sw: Kutoka...

# session_expired
source: Your session has expired. Please log in again
sw: Sehemu yako imeisha muda wake. Tafadhali ingia tena

# welcome_title
source: Welcome to MonEkole
sw: Karibu MonEkole

# welcome_subtitle
source: Smart school management
sw: Usimamizi wa shule ulio bora

source: Who are you?
sw: Wewe ni nani?

# select_user_type
source: Select your profile to continue
sw: Chagua wasifu wako

source: Administrative
sw: Utawala

# login_as_teacher
source: Teacher Login
sw: Kuingia Mwalimu

# login_as_parent
source: Parent Login
sw: Kuingia Mzazi

# login_as_student
source: Student Login
sw: Kuingia Mwanafunzi

# login_as_administrative
source: Admin Login
sw: Kuingia Utawala
